# Python学习笔记-运算符

# 基础运算符-加减乘除=========================================================================================================
print(1 + 1, type(1 + 1))  # 结果默认为int
print(1 - 1, type(1 - 1))  # 结果默认为int
print(2 * 2, type(2 * 2))  # 结果默认为int
print(6 / 2, type(6 / 2))  # 除法结果默认为float

# 特殊运算
print(11 // 2)  # 整除运算，取整数部分，舍弃余数
print(11 % 2)  # 取模运算，只取余数，舍弃整数
print(2 ** 10)  # 幂运算，2为底数，10为幂

# 正负运算
print(9 // 4)  # 结果为2
print(-9 // -4)  # 结果2

# 一正一负的整数公式，向下取整，9/-4，结果为-2.25，向下取整数则为-3
print(9 // -4)  # 结果为-3
print(-9 // 4)  # 结果为-3

# 一正一负取余：余数=被除数-除数*商 |（商向下取整）
print(9 % -4)  # 结果为-3  9-（-4）*（-3）=-3
print(-9 % 4)  # 结果为3   -9-4*（-3）=3

# 赋值运算符（从右到左）：链式赋值 参数赋值 系列解包赋值===========================================================================
# 链式赋值
a = b = c = d = e = f = 20
print(id(a), id(b), id(c), id(d), id(e), id(f))

# 参数赋值
a += 30  # a=a+30的简写
b -= 10  # b=b-10的简写
c *= 10  # c=c*10的简写
d /= 9  # d=d/9的简写
e //= 6  # e=e/6结果取整数的简写
f %= 6  # f=f/6结果取余数的简写
print(a, b, c, d, e, f)

# 系列解包赋值
a, b, c = 10, 20, 30  # 等号左右两边元素个数必须相同，否则报错
print(a, b, c)

# a,b值交换
print('===============================')
print('交换前的值：' + 'a:' + str(a) + '    b:' + str(b))
a, b = b, a  # a,b值交换
print('交换后的值：' + 'a:' + str(a) + '    b:' + str(b))
print('===============================')

# 比较运算符===============================================================================================================
# 比较运算符：结果为bool类型 符号 <  >  <=  >=   ==  !=
print('a>b吗？', a > b)
print('a<b吗？', a < b)

# 比较单个变量的id标识使用 is     is not
q = 100
w = 100
print(id(q), id(w))
print(q is w)  # q=w,id标识相等，Ture
print(q is not w)  # q等于w,id标识相等，False

print('比较数组的id标识==================================================================================================')
lis1 = [1, 2, 2, 3]
lis2 = [1, 2, 2, 3]
print('lis1 = [1, 2, 2, 3]          lis2 = [1, 2, 2, 3]')
print('lis1的id标识：' + str(id(lis1)) + '   ' + 'lis2的id标识：' + str(id(lis2)))
print('lis1的值是否等于lis2？', lis1 == lis2)  # Ture 数组里面的值相等
print('lis1的id标识是否等于lis2？', lis1 is lis2)  # False id不相等

#布尔运算符==============================================================================================================
#符号： and, or, not, in, not in
a, b = 1, 2
#and or 逻辑判断=================
print(a == 1 and b == 2)    #Ture
print(a != 1 and b == 2)    #False

print(a == 1 or b == 2)    #Ture
print(a != 1 or b == 2)    #Ture
print(a != 1 or b != 2)    #Flase

#not,用来取反====================
f = True
f2 = False
print(not f)        #取f反值
print(not f2)       #取f2反值

print('=================in和not in=====================')
weather = 'sunny'
print('n' in weather)   #判断weather的值中是否有n Ture
print('k' not in weather)   #判断weather的值中没有k Ture

#位运算符================================================================================================================
#按位与&（同为1时结果为1，其他为0）  按位或 | （对应数位都是0，结果才为0，否则为1）
print(4 & 8)    #将4和8转换为二进制，结果为0
print(4 | 8)    #将4和8转换为二进制，结果为12

#移位运算符 <<(向左移位)相当于×2                >>（向右移位）相当于 /2
print(4 << 1)   #4转换为二进制，向左移一位（高位溢出，低位补零） 8 相当于*2
print(4 << 2)   #4转换为二进制，向左移两位（高位溢出，低位补零） 16 相当于*2*2
print(4 >> 1)   #4转换为二进制，向左移两位（高位溢出，低位补零） 2  相当于除以2

print('运算符优先等级：算数运算符>位运算符>比较运算符>布尔运算符>赋值运算符')